app/views/resenas/index.html.erb

  <%if current_user.id != @course.instructor%>
    <%if current_user.courses.include? @course%>
---
SELECT  1 AS one FROM "courses" INNER JOIN "courses_users" ON "courses"."id" = "courses_users"."course_id" WHERE "courses_users"."user_id" = $1 AND "courses"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 2], ["LIMIT", 1]]