app/views/courses/index.html.erb

SELECT "courses".* FROM "courses" INNER JOIN "courses_users" ON "courses"."id" = "courses_users"."course_id" WHERE "courses_users"."user_id" = $1  [["user_id", 2]]
---
        <div class="columns">
            <% current_user.courses.each do |course| %>