app/views/courses/show.html.erb

    <div class="columns">
        <% @course.clases.each do |clase| %>
---
SELECT "clases".* FROM "clases" WHERE "clases"."course_id" = $1  [["course_id", 1]]

                    <p class="title">Class <%= clase.numero %> - <%= clase.nombre %></p><hr>
                    <%if current_user.courses.include? @course%>
---
SELECT  1 AS one FROM "courses" INNER JOIN "courses_users" ON "courses"."id" = "courses_users"."course_id" WHERE "courses_users"."user_id" = $1 AND "courses"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 1], ["LIMIT", 1]]

    <%if @course.instructor != current_user.id%>
        <%if current_user.courses.include? @course%>
---
SELECT  1 AS one FROM "courses" INNER JOIN "courses_users" ON "courses"."id" = "courses_users"."course_id" WHERE "courses_users"."user_id" = $1 AND "courses"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 1], ["LIMIT", 1]]

    <%if @course.instructor != current_user.id%>
        <%if current_user.courses.include? @course%>
---
SELECT  1 AS one FROM "courses" INNER JOIN "courses_users" ON "courses"."id" = "courses_users"."course_id" WHERE "courses_users"."user_id" = $1 AND "courses"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 1], ["LIMIT", 1]]