app/controllers/clases_controller.rb

INSERT INTO "clases" ("numero", "nombre", "contenido", "created_at", "updated_at", "course_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["numero", 1], ["nombre", "clase 1: angulos"], ["contenido", "video"], ["created_at", "2021-11-20 23:46:25.222412"], ["updated_at", "2021-11-20 23:46:25.222412"], ["course_id", 1]]
---
  def create
    @clases_params = params.require(:clase).permit(:numero, :nombre, :contenido, :course_id)
    @clase = Clase.create(@clases_params)

SELECT  "clases".* FROM "clases" WHERE "clases"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def show
    @clase = Clase.find(params[:id])
    @course = Course.find(@clase.course_id)

SELECT  "clases".* FROM "clases" WHERE "clases"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "clases" WHERE "clases"."id" = $1  [["id", 2]]
---
  def destroy
    @clase = Clase.find(params[:id])
    @clase.destroy