app/controllers/courses_controller.rb

  def create
    @course_params = params.require(:course).permit(:name, :description, :category, :instructor)
    @course = Course.new(@course_params)
    if @course.save
---
INSERT INTO "courses" ("name", "description", "category", "created_at", "updated_at", "instructor") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def signup
    @user = current_user
    @course = Course.find(params[:course_id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]