app/controllers/forums_controller.rb

INSERT INTO "forums" ("name", "created_at", "updated_at", "course_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "foro 1"], ["created_at", "2021-11-23 02:06:25.292173"], ["updated_at", "2021-11-23 02:06:25.292173"], ["course_id", 2]]
---
  def create
    @forums_params = params.require(:forum).permit(:name, :course_id)
    @forum = Forum.create(@forums_params)

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def index
    @course = Course.find(params[:course_id])

SELECT  "forums".* FROM "forums" WHERE "forums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @forum = Forum.find(params[:id])

SELECT  "forums".* FROM "forums" WHERE "forums"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "forums" SET "name" = $1, "updated_at" = $2 WHERE "forums"."id" = $3  [["name", "Dudas !"], ["updated_at", "2021-11-28 22:41:05.894232"], ["id", 2]]
---
  def update
    @forum = Forum.find(params[:id])
    @forums_new_params = params.require(:forum).permit(:name)
    if @forum.update(@forums_new_params)

SELECT  "forums".* FROM "forums" WHERE "forums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "forums" WHERE "forums"."id" = $1  [["id", 1]]
---
  def destroy
    @forum = Forum.find(params[:id])
    @forum.destroy