app/controllers/home_controller.rb

SELECT "courses".* FROM "courses" WHERE (name LIKE '%hablar%' OR description LIKE '%hablar%')
---
  def index
    @courses = Course.all