app/controllers/messages_controller.rb

SELECT  "forums".* FROM "forums" WHERE "forums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "messages".* FROM "messages" WHERE "messages"."forum_id" = $1  [["forum_id", 1]]
---
  def new
    @message = Message.new
    @message.forum_id = params[:forum_id]
    @message.user_id = params[:user_id]
    @forum = Forum.find(params[:forum_id])
    @messages = @forum.messages
    @course = Course.find(@forum.course_id)

INSERT INTO "messages" ("contenido", "created_at", "updated_at", "forum_id", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["contenido", "buena cancion esa"], ["created_at", "2021-11-23 02:06:34.644316"], ["updated_at", "2021-11-23 02:06:34.644316"], ["forum_id", 1], ["user_id", 1]]
SELECT  "forums".* FROM "forums" WHERE "forums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def create
    @messages_params = params.require(:message).permit(:contenido, :forum_id, :user_id)
    @message = Message.create(@messages_params)
    @forum = Forum.find(@messages_params[:forum_id])
    if @message.save
      @user = User.find(@message.user_id)

SELECT  "messages".* FROM "messages" WHERE "messages"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT  "forums".* FROM "forums" WHERE "forums"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "messages" WHERE "messages"."id" = $1  [["id", 4]]
---
  def destroy
    @message = Message.find(params[:id])
    @forum = Forum.find(@message.forum_id)
    @message.destroy