app/controllers/resenas_controller.rb

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def index
    @course = Course.find(params[:course_id])

SELECT  "resenas".* FROM "resenas" WHERE "resenas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @resena = Resena.find(params[:id])

INSERT INTO "resenas" ("calificacion", "contenido", "created_at", "updated_at", "course_id", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["calificacion", 4], ["contenido", "buen curso igual"], ["created_at", "2021-11-23 02:08:34.802408"], ["updated_at", "2021-11-23 02:08:34.802408"], ["course_id", 2], ["user_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def create
    @resenas_params = params.require(:resena).permit(:calificacion, :contenido, :course_id, :user_id)
    @resena = Resena.create(@resenas_params)
    if @resena.save
      @user = User.find(@resena.user_id)

SELECT  "resenas".* FROM "resenas" WHERE "resenas"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "resenas" WHERE "resenas"."id" = $1  [["id", 2]]
---
  def destroy
    @resena = Resena.find(params[:id])
    @resena.destroy

SELECT  "resenas".* FROM "resenas" WHERE "resenas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_resena
    @resena = Resena.find(params[:id])