app/models/course.rb

  def average_rating(id)
    resenas = Resena.all.pluck(:course_id, :calificacion)
---
SELECT "resenas"."course_id", "resenas"."calificacion" FROM "resenas"